{"status":"ok","totalResults":10,"articles":
[
    {"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Community in mourning after three girls killed in Southport knife attack",
    "description":"Elsie Dot Stancombe, Alice Dasilva Aguiar and Bebe King were at a dance workshop when the attack occurred.",
    "url":"https://www.bbc.co.uk/news/articles/cd194zkw4d9o",
    "urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/9e82/live/984f9460-4e7f-11ef-aebc-6de4d31bf5cd.jpg","publishedAt":"2024-07-31T03:37:14.8040639Z",
    "content":"Some of the crowd threw missiles at officers and the mosque. \r\nMerseyside Police said supporters of the far right English Defence League were behind the violence, which Assistant Chief Constable Alex… [+896 chars]"},
    
    
    
    {
        "source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Emmanuel Macron's lobster banquet for King Charles III cost French presidency €450,000",
        "description":"The country's audit office has warned that \"significant efforts\" are needed to restore financial balance after an increase in spending.",
        "url":"https://www.bbc.co.uk/news/articles/c4ng50pj2l8o",
        "urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/b724/live/21265a70-4e95-11ef-861a-adebe2b76ed8.jpg","publishedAt":"2024-07-31T03:07:12.2571231Z",
        "content":"Of the money spent on the dinner, over 165,000 was on catering, with another 40,000 on drinks.\r\nGuests at the star-studded banquet - which included actor Hugh Grant, football manager Arsene Wenger an… [+1046 chars]"},
        
        
        {
            "source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Who will Kamala Harris pick for VP? Shapiro and Kelly among finalists","description":"The vice-president has a shortlist of five possible running mates, according to US media.","url":"https://www.bbc.co.uk/news/articles/ce4q832w7dgo","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/0630/live/2462f5f0-4ee4-11ef-87a7-4f2b05977cca.jpg","publishedAt":"2024-07-31T02:52:13.9124168Z","content":"The Democratic governor has been close to Ms Harris for a long time. \r\nMr Beshear, 46, has been able to carve out a successful career as a Democrat in a state that Donald Trump carried by 20 points i… [+948 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"The new face of homelessness in Australia","description":"Mary is a frail pensioner who is living out of her car after losing her rental property.","url":"https://www.bbc.co.uk/news/articles/cn09g9j143no","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/4dc2/live/c6c7ab90-4e96-11ef-b2d2-cdb23d5d7c5b.jpg","publishedAt":"2024-07-31T01:07:21.7873683Z","content":"This isnt the retirement that Mary had dreamed of.\r\nThe former midwife spent years living on a cattle station with her husband on the north-western edge of Australia - outside her window, the vast an… [+1712 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Rise in people simply fascinated by violence - warn terror police","description":"UK and US officers say they are seeing threats from individuals who don't support a particular ideology.","url":"https://www.bbc.co.uk/news/articles/c6p20dl71jpo","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/6e9b/live/4e972fe0-4e61-11ef-b2d2-cdb23d5d7c5b.jpg","publishedAt":"2024-07-31T00:37:12.6789593Z","content":"The threat from international and domestic terror presents a breadth of challenge greater than it has ever been, according to senior US and UK police officers who oversaw the successful prosecution o… [+1341 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Anjem Choudary: Radical preacher jailed for life","description":"The sentence means Choudary cannot seek to leave jail on licence until he is more than 85 years old.","url":"https://www.bbc.co.uk/news/articles/c3geqp8vx08o","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/852c/live/f236b200-4e6c-11ef-aebc-6de4d31bf5cd.jpg","publishedAt":"2024-07-31T00:22:14.6941666Z","content":"He was convicted last week of directing a terror organisation after a complex operation involving detectives and investigators in the US, Canada and the UK.\r\nMr Justice Wall said Choudarys group was … [+1638 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Israel claims it killed senior Hezbollah commander in strike on Beirut","description":"The Israeli military said Fuad Shukr was \"eliminated\" but local security sources say he was not in the building that was hit.","url":"https://www.bbc.co.uk/news/articles/c1rwxyjydlyo","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/11b4/live/4cc2b930-4ebd-11ef-aebc-6de4d31bf5cd.jpg","publishedAt":"2024-07-30T23:22:15.6630265Z","content":"He described it as a \"criminal act\" in a \"series of aggressive operations killing civilians in clear and explicit violation of international law.\"\r\nIn a brief post on social media after the attack, I… [+853 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Southport protest sees officers injured and police van set alight","description":"The protest came just hours after people in Southport held a vigil for Monday's knife attack victims.","url":"https://www.bbc.co.uk/news/articles/cv2gyv882nvo","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/6b9f/live/0948c7b0-4eb0-11ef-8f0f-0577398c3339.jpg","publishedAt":"2024-07-30T22:37:18.5060013Z","content":"Merseyside Police said those behind the violence had been fired up by social media posts which incorrectly suggested an Islamist link to Mondays stabbings.\r\nThe Home Secretary Yvette Cooper had earli… [+850 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"New Secret Service boss reveals fresh Trump shooting details","description":"In a tense hearing, Acting Director Ronald Rowe shared new details about security failures, the would-be assassin and changes.","url":"https://www.bbc.co.uk/news/articles/cw4yz20dekjo","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/b7c4/live/6eaa9c60-4ea5-11ef-b260-43c80ef6eee9.jpg","publishedAt":"2024-07-30T19:37:16.2715909Z","content":"During the occasionally tense hearing, Mr Rowe on several occasions made reference to the mental toll that the Butler shooting security failures have taken, on him and his agents. \r\n\"My people are hu… [+1137 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"BBC News","title":"Barbara Butch: French DJ files legal complaint over Paris Olympics opening ceremony abuse","description":"Barbara Butch took part in a drag queen sequence during the event which sparked controversy.","url":"https://www.bbc.co.uk/news/articles/c0xj358y7n5o","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/7f63/live/aa178720-4e7a-11ef-aebc-6de4d31bf5cd.jpg","publishedAt":"2024-07-30T15:37:17.6634101Z","content":"Jolly added it was obvious that the tableau was not inspired by The Last Supper given the presence of a figure representing the Greek god Dionysus.\r\nBut some viewers who interpreted it as a reference… [+1541 chars]"}]}